content/posts/A_thorough_introduction_to_the_theory_of_general_relativity_by_Frederic_Schuller_in_2015.md
+++
title = "A thorough introduction to the theory of general relativity by Frederic Schuller in 2015"
author = ["Cameron Smith"]
lastmod = 2020-09-24T21:57:43-04:00
slug = "A_thorough_introduction_to_the_theory_of_general_relativity_by_Frederic_Schuller_in_2015"
draft = false
+++

-   [YouTube playlist for lectures](https://www.youtube.com/playlist?list=PLFeEvEPtX%5F0S6vxxiiNPrJbLu9aK1UVC%5F)
-   tutorials
    -   [YouTube playlist for Tutorials](https://www.youtube.com/playlist?list=PLFeEvEPtX%5F0RQ1ys-7VIsKlBWz7RX-FaL)
    -   [links to tutorial problems with solutions](http://mathswithphysics.blogspot.com/2016/07/the-we-heraeus-international-winter.html) and [direct link to original course website](https://gravity-and-light.herokuapp.com/tutorials)
-   [Lecture notes by lazierthanthou](https://github.com/lazierthanthou/Lecture%5FNotes%5FGR)


## 1. Topology {#1-dot-topology}


## 2. Topological manifolds {#2-dot-topological-manifolds}


## 3. Multilinear algebra {#3-dot-multilinear-algebra}


## 4. Differentiable manifolds {#4-dot-differentiable-manifolds}


## 5. Tangent spaces {#5-dot-tangent-spaces}


## 6. Fields {#6-dot-fields}


### [Serre–Swan theorem - Wikipedia](https://en.wikipedia.org/wiki/Serre%E2%80%93Swan%5Ftheorem) {#serre-swan-theorem-wikipedia}

<!--list-separator-->

-  Suppose \\[M\\] is a smooth manifold (not necessarily compact), and \\[E\\] is a smooth vector bundle over \\[M\\]. Then \\[\Gamma (E)\\], the space of smooth sections of \\[E\\], is a module over \\[C^{\infty}(M)\\] (the commutative algebra of smooth real-valued functions on \\[M\\]). Swan's theorem states that this module is finitely generated and projective over \\[C^{\infty}(M)\\].

<!--list-separator-->

-  <https://math.stackexchange.com/a/3088705/>


## 7. Connections {#7-dot-connections}


## 8. Parallel transport and curvature {#8-dot-parallel-transport-and-curvature}


## 9. Newtonian spacetime is curved! {#9-dot-newtonian-spacetime-is-curved}


### Newtonian gravity can be formulated such that gravity is a curvature of Newtonian spacetime {#newtonian-gravity-can-be-formulated-such-that-gravity-is-a-curvature-of-newtonian-spacetime}

<!--list-separator-->

-  Axiom I: particles under the influence of no other force moves along a straight worldline in spacetime


## 10. Metric manifolds {#10-dot-metric-manifolds}


## 11. Symmetry {#11-dot-symmetry}


## 12. Integration on manifolds {#12-dot-integration-on-manifolds}


## 13. Spacetime {#13-dot-spacetime}


## 14. Matter {#14-dot-matter}


## 15. Einstein gravity {#15-dot-einstein-gravity}


## 16. Optical geometry I {#16-dot-optical-geometry-i}


## 17. Optical geometry II {#17-dot-optical-geometry-ii}


## 18. Canonical formulation of GR I {#18-dot-canonical-formulation-of-gr-i}


## 19. Canonical formulation of GR II {#19-dot-canonical-formulation-of-gr-ii}


## 20. Cosmology \* the early epoch {#20-dot-cosmology-the-early-epoch}


## 21. Cosmology \* the late epoch {#21-dot-cosmology-the-late-epoch}


## 22. Black holes {#22-dot-black-holes}


## 23. Penrose diagrams {#23-dot-penrose-diagrams}


## 24. Perturbation theory I {#24-dot-perturbation-theory-i}


## 25. Perturbation theory II {#25-dot-perturbation-theory-ii}


## 26. How quantizable matter gravitates {#26-dot-how-quantizable-matter-gravitates}


### Explain why gravity can be derived from given matter dynamics (4:06) {#explain-why-gravity-can-be-derived-from-given-matter-dynamics--4-06}


### Set --> Topology --> Smooth atlas --> Lorentzian metric --> Spinorial matter (fermions) --> Tensorial matter (bosons) --> Maxwell electromagnetism / Einstein gravity dynamics / Standard model dynamics (5:13) {#set-topology-smooth-atlas-lorentzian-metric-spinorial-matter--fermions--tensorial-matter--bosons--maxwell-electromagnetism-einstein-gravity-dynamics-standard-model-dynamics--5-13}


### Observations {#observations}

<!--list-separator-->

-  Einstein-Minkowski

    <!--list-separator-->

    -  Maxwell electromagnetism --> Lorentzian metric

<!--list-separator-->

-  Einstein-Kuchar-Teitelboim

    <!--list-separator-->

    -  Lorentzian metric --> Einstein gravity dynamics


### Einstein equations relate the Einstein curvature of spacetime to the energy-momentum tensor of matter {#einstein-equations-relate-the-einstein-curvature-of-spacetime-to-the-energy-momentum-tensor-of-matter}


### Refined physical definition of spacetime {#refined-physical-definition-of-spacetime}

-   A spacetime is a triple \\[(M, G,S[G,\Phi])\\] with
    -   A smooth manifold \\[M\\]
    -   A smooth tensor field "the geometry" \\[G\\] (Lorentzian metric as a special case)
    -   A test matter action "the matter" \\[S[G, \Phi]\\] (Maxwell action)
    -   Such that the principal polynomial \\[P\\] and \\(P^{\sharp}\\) are both hyperbolic


### Gravitational dynamics {#gravitational-dynamics}

<!--list-separator-->

-


## 27. Sources of gravitational waves {#27-dot-sources-of-gravitational-waves}


## 28. How to detect gravitational waves {#28-dot-how-to-detect-gravitational-waves}
